Model: "sequential_1"
___________________________________________________________________________________________________________
Layer (type)                                    Output Shape                              Param #          
===========================================================================================================
embedding (Embedding)                           (None, 250, 128)                          2560000          
___________________________________________________________________________________________________________
dropout_3 (Dropout)                             (None, 250, 128)                          0                
___________________________________________________________________________________________________________
conv1d (Conv1D)                                 (None, 246, 64)                           41024            
___________________________________________________________________________________________________________
max_pooling1d (MaxPooling1D)                    (None, 61, 64)                            0                
___________________________________________________________________________________________________________
lstm (LSTM)                                     (None, 70)                                37800            
___________________________________________________________________________________________________________
dense_2 (Dense)                                 (None, 1)                                 71               
___________________________________________________________________________________________________________
activation_6 (Activation)                       (None, 1)                                 0                
===========================================================================================================
Total params: 2,638,895
Trainable params: 2,638,895
Non-trainable params: 0
___________________________________________________________________________________________________________

Processing time for training (seconds): 408.631820
Training set accuracy: 0.9682
Training set loss: 0.1355
Hold-out test set set accuracy: 0.8407
Hold-out test set set loss: 0.7261