_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_2 (Embedding)      (None, 250, 128)          2560000   
_________________________________________________________________
dropout_2 (Dropout)          (None, 250, 128)          0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 246, 64)           41024     
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 61, 64)            0         
_________________________________________________________________
lstm_2 (LSTM)                (None, 70)                37800     
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 71        
_________________________________________________________________
activation_2 (Activation)    (None, 1)                 0         
=================================================================
Total params: 2,638,895
Trainable params: 2,638,895
Non-trainable params: 0
_________________________________________________________________

Processing time for training (seconds): 1227.013848
Training set accuracy: 0.9726
Training set loss: 0.1159
Hold-out test set accuracy: 0.8479
Hold-out test set loss: 0.6466