Model: "sequential"
___________________________________________________________________________________________________________
Layer (type)                                    Output Shape                              Param #          
===========================================================================================================
conv2d (Conv2D)                                 (None, 32, 32, 32)                        896              
___________________________________________________________________________________________________________
activation (Activation)                         (None, 32, 32, 32)                        0                
___________________________________________________________________________________________________________
conv2d_1 (Conv2D)                               (None, 30, 30, 32)                        9248             
___________________________________________________________________________________________________________
activation_1 (Activation)                       (None, 30, 30, 32)                        0                
___________________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)                    (None, 15, 15, 32)                        0                
___________________________________________________________________________________________________________
dropout (Dropout)                               (None, 15, 15, 32)                        0                
___________________________________________________________________________________________________________
conv2d_2 (Conv2D)                               (None, 15, 15, 64)                        18496            
___________________________________________________________________________________________________________
activation_2 (Activation)                       (None, 15, 15, 64)                        0                
___________________________________________________________________________________________________________
conv2d_3 (Conv2D)                               (None, 13, 13, 64)                        36928            
___________________________________________________________________________________________________________
activation_3 (Activation)                       (None, 13, 13, 64)                        0                
___________________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)                  (None, 6, 6, 64)                          0                
___________________________________________________________________________________________________________
dropout_1 (Dropout)                             (None, 6, 6, 64)                          0                
___________________________________________________________________________________________________________
flatten (Flatten)                               (None, 2304)                              0                
___________________________________________________________________________________________________________
dense (Dense)                                   (None, 512)                               1180160          
___________________________________________________________________________________________________________
activation_4 (Activation)                       (None, 512)                               0                
___________________________________________________________________________________________________________
dropout_2 (Dropout)                             (None, 512)                               0                
___________________________________________________________________________________________________________
dense_1 (Dense)                                 (None, 10)                                5130             
___________________________________________________________________________________________________________
activation_5 (Activation)                       (None, 10)                                0                
===========================================================================================================
Total params: 1,250,858
Trainable params: 1,250,858
Non-trainable params: 0
___________________________________________________________________________________________________________

Processing time for training (seconds): 1891.762299
Training set accuracy: 0.8763
Training set loss: 0.3919
Hold-out test set set accuracy: 0.7524
Hold-out test set set loss: 0.7384