Model: "sequential_1"
__________________________________________________________________________________________________
Layer (type)                                Output Shape                           Param #        
==================================================================================================
conv2d (Conv2D)                             (None, 32, 32, 32)                     896            
__________________________________________________________________________________________________
activation_1 (Activation)                   (None, 32, 32, 32)                     0              
__________________________________________________________________________________________________
conv2d_1 (Conv2D)                           (None, 30, 30, 32)                     9248           
__________________________________________________________________________________________________
activation_2 (Activation)                   (None, 30, 30, 32)                     0              
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)                (None, 15, 15, 32)                     0              
__________________________________________________________________________________________________
dropout_1 (Dropout)                         (None, 15, 15, 32)                     0              
__________________________________________________________________________________________________
conv2d_2 (Conv2D)                           (None, 15, 15, 64)                     18496          
__________________________________________________________________________________________________
activation_3 (Activation)                   (None, 15, 15, 64)                     0              
__________________________________________________________________________________________________
conv2d_3 (Conv2D)                           (None, 13, 13, 64)                     36928          
__________________________________________________________________________________________________
activation_4 (Activation)                   (None, 13, 13, 64)                     0              
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)              (None, 6, 6, 64)                       0              
__________________________________________________________________________________________________
dropout_2 (Dropout)                         (None, 6, 6, 64)                       0              
__________________________________________________________________________________________________
flatten (Flatten)                           (None, 2304)                           0              
__________________________________________________________________________________________________
dense_1 (Dense)                             (None, 512)                            1180160        
__________________________________________________________________________________________________
activation_5 (Activation)                   (None, 512)                            0              
__________________________________________________________________________________________________
dropout_3 (Dropout)                         (None, 512)                            0              
__________________________________________________________________________________________________
dense_2 (Dense)                             (None, 10)                             5130           
__________________________________________________________________________________________________
activation_6 (Activation)                   (None, 10)                             0              
==================================================================================================
Total params: 1,250,858
Trainable params: 1,250,858
Non-trainable params: 0
__________________________________________________________________________________________________

Processing time for training (seconds): 1737.388483
Training set accuracy: 0.8624
Training set loss: 0.4171
Hold-out test set set accuracy: 0.7497
Hold-out test set set loss: 0.7660