Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_1 (Embedding)      (None, 250, 128)          2560000   
_________________________________________________________________
dropout_4 (Dropout)          (None, 250, 128)          0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 246, 64)           41024     
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 61, 64)            0         
_________________________________________________________________
lstm_1 (LSTM)                (None, 70)                37800     
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 71        
_________________________________________________________________
activation_7 (Activation)    (None, 1)                 0         
=================================================================
Total params: 2,638,895
Trainable params: 2,638,895
Non-trainable params: 0
_________________________________________________________________

Processing time for training (seconds): 613.190713
Training set accuracy: 0.9737
Training set loss: 0.1133
Hold-out test set accuracy: 0.8568
Hold-out test set loss: 0.6228