Model: "sequential"
__________________________________________________________________________________________________
Layer (type)                                Output Shape                           Param #        
==================================================================================================
embedding (Embedding)                       (None, 250, 128)                       2560000        
__________________________________________________________________________________________________
dropout (Dropout)                           (None, 250, 128)                       0              
__________________________________________________________________________________________________
conv1d (Conv1D)                             (None, 246, 64)                        41024          
__________________________________________________________________________________________________
max_pooling1d (MaxPooling1D)                (None, 61, 64)                         0              
__________________________________________________________________________________________________
lstm (LSTM)                                 (None, 70)                             37800          
__________________________________________________________________________________________________
dense (Dense)                               (None, 1)                              71             
__________________________________________________________________________________________________
activation (Activation)                     (None, 1)                              0              
==================================================================================================
Total params: 2,638,895
Trainable params: 2,638,895
Non-trainable params: 0
__________________________________________________________________________________________________

Processing time for training (seconds): 562.138980
Training set accuracy: 0.9732
Training set loss: 0.1149
Hold-out test set set accuracy: 0.8492
Hold-out test set set loss: 0.6551